In [1]:
#                                                         ques - 1

In [ ]:
""" there are many functions in pandas library. here 5 of them are following :
    1. read_csv() : It is a function included in pandas library through which we can read csv files whose values are seperated by 
                    comma's. also there are many other files reading functions like html file,excel files,or files from internet
                    through links.
    
    2. fillna() : It is a function through which we can fill the missing values of the DataFrame.
    
    3. describe() : It is a function that shows some statical values which is calculated from the DataFrame or series. it consist of 
                    mean value, max , min , count,etc.
                    
    4. Rename() : This function is used to change any index,column or rows.
    
    5. drop() : this function is used to drop rows/columns from the DataFrame.
"""

In [3]:
#                                                         ques - 2

In [4]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [42]:
import pandas as pd
def renew_index():
    df = pd.DataFrame({'A':[1,2,3,4,5],'B':[5,4,3,2,1],'C':[2,4,6,8,10]})
    df['new Index'] = [ x for x in range(1 , len(df)+5,2)]
    return df

renew_index()

   A  B   C  new Index
0  1  5   2          1
1  2  4   4          3
2  3  3   6          5
3  4  2   8          7
4  5  1  10          9

In [9]:
#                                                         ques - 3

In [43]:
def sum_values():
    df2 = pd.DataFrame({'values':[1,3,4,5,6,7]})
    df2
    print("the sum of first 3 values are :",df2.head(3).sum())
    
sum_values()

the sum of first 3 values are : values    8
dtype: int64

In [12]:
#                                                         ques - 4

In [47]:
def word_count():
    df3 = pd.DataFrame({'Text':['Ram raju','shyam','mohan','radha','Krishna']})
    df3['Word_count'] = [len(x.split()) for x in df3['Text'].tolist()]
    return df3
    
word_count()

       Text  Word_count
0  Ram raju           2
1     shyam           1
2     mohan           1
3     radha           1
4   Krishna           1

In [17]:
#                                                         ques - 5

In [ ]:
""" the DataFrame.size() functions returns the no of elements present in (rows) X (columns) in case of Dataframe and no of
    rows elements in case of series.
    
    the DataFrame.shape() function returns the dimensions of the dataframe which is (rows,columns).
"""

In [ ]:
#                                                         ques - 6

In [ ]:
# To read the excel file in pandas, we use the read_excel() function.

In [ ]:
#                                                         ques - 7

In [39]:
def username():
    df4 = pd.DataFrame({'Email':['viivekkumarsharma@gmail.com','siinghvivek499666@gmail.com','vivekkumar854100@gmail.com','0111al211182vivek@gmail.com']})
    df4['username'] = df4['Email'].str.split("@").str[0]
    return df4

username()

                         Email           username
0  viivekkumarsharma@gmail.com  viivekkumarsharma
1  siinghvivek499666@gmail.com  siinghvivek499666
2   vivekkumar854100@gmail.com   vivekkumar854100
3  0111al211182vivek@gmail.com  0111al211182vivek

In [ ]:
#                                                         ques - 8

In [38]:
def dataFrame():
    data = {'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]}
    df5 = pd.DataFrame(data)
    df5
    Dataframe = pd.DataFrame(df5.loc[(df5['A']>5) & (df5['B']<10)])
    return Dataframe

dataFrame()

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
#                                                         ques - 9

In [61]:
def calc_values():
    df6 = pd.DataFrame({'Values':[1,2,3,4,5,6,7,8]})
    return df6['Values'].mean(),df6['Values'].median(),df6['Values'].std()

calc_values()

(4.5, 4.5, 2.449489742783178)

In [ ]:
#                                                         ques - 10

In [66]:
def moving_average():
    df7 = pd.DataFrame({'Sales':[4,6,8,10,12,14,16,18],'Date':[1,2,3,4,5,6,7,8]})
    return df7['Sales'].rolling(7).mean()

moving_average()

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
5     NaN
6    10.0
7    12.0
Name: Sales, dtype: float64

In [ ]:
#                                                          ques - 11

In [79]:
def weekday():
    df8 = pd.DataFrame({'Date':['2023-1-1','2023-1-2','2023-1-3','2023-1-4','2023-1-5']})
    df8['Date'] = pd.to_datetime(df8['Date'])
    df8['Weekday'] = df8['Date'].dt.day_name()
    return df8

weekday()

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
#                                                          ques - 12

In [84]:
def date_selection():
    df9 = pd.DataFrame({'date':['2023-1-1','2023-1-2','2023-3-17','2023-1-3','2023-1-4','2023-1-5','2023-2-12']})
    df9['date'] = pd.to_datetime(df9['date'], format='%Y-%m-%d')
    dataframe = pd.DataFrame(df9.loc[(df9['date']>='2023-1-1') & (df9['date']<='2023-1-31')])
    return dataframe
date_selection()

        date
0 2023-01-01
1 2023-01-02
3 2023-01-03
4 2023-01-04
5 2023-01-05

In [ ]:
#                                                          ques - 13

In [ ]:
""" to use the basic functons of pandas library , thr first thing we have to import is pandas itself 
    for example we write [ import pandas as pd] . here pandas is the library that must be imported to
    perfrom the basic functions.
"""